========================================
simple
========================================

class_declaration {
  @class_name = 'Hello'
}

---

(source_file
  (selector
    (node_type_selector
      (node_type)))
  (selector
    (block_selector
      (statement
        (condition
          (text_eq_condition
            (selector
              (variable_identifier
                (identifier)))
            (string_literal
              (string_fragment))))))))

========================================
selector
========================================

class_declaration {
  .decorator > call_expression.identifier = 'Hello'
}

---

(source_file
  (selector
    (node_type_selector
      (node_type)))
  (selector
    (block_selector
      (statement
        (condition
          (text_eq_condition
            (selector
              (field_name_selector
                (selector
                  (child_selector
                    (selector
                      (field_name_selector
                        (field_name)))
                    (selector
                      (node_type_selector
                        (node_type)))))
                (field_name)))
            (string_literal
              (string_fragment))))))))

========================================
empty
========================================

class_declaration {
  !@class_name
}

---

(source_file
  (selector
    (node_type_selector
      (node_type)))
  (selector
    (block_selector
      (statement
        (condition
          (empty_condition
            (selector
              (variable_identifier
                (identifier)))))))))

========================================
compound
========================================

class_declaration {
  !@class_name && @class_name = 'not empty'
}

---

(source_file
  (selector
    (node_type_selector
      (node_type)))
  (selector
    (block_selector
      (statement
        (condition
          (and_condition
            (condition
              (empty_condition
                (selector
                  (variable_identifier
                    (identifier)))))
            (condition
              (text_eq_condition
                (selector
                  (variable_identifier
                    (identifier)))
                (string_literal
                  (string_fragment))))))))))

========================================
parentheses
========================================

class_declaration {
  (!@class_name && !@class_name) || !@class_name;

  !@class_name && (!@class_name || !@class_name);
}

---

(source_file
  (selector
    (node_type_selector
      (node_type)))
  (selector
    (block_selector
      (statement
        (condition
          (or_condition
            (condition
              (condition
                (and_condition
                  (condition
                    (empty_condition
                      (selector
                        (variable_identifier
                          (identifier)))))
                  (condition
                    (empty_condition
                      (selector
                        (variable_identifier
                          (identifier))))))))
            (condition
              (empty_condition
                (selector
                  (variable_identifier
                    (identifier))))))))
      (statement
        (condition
          (and_condition
            (condition
              (empty_condition
                (selector
                  (variable_identifier
                    (identifier)))))
            (condition
              (condition
                (or_condition
                  (condition
                    (empty_condition
                      (selector
                        (variable_identifier
                          (identifier)))))
                  (condition
                    (empty_condition
                      (selector
                        (variable_identifier
                          (identifier))))))))))))))
