========================================
simple
========================================

class_declaration {
  class_body {
    method_definition {
    }
  }
}

---

(source_file
  (query
    (node_type_identifier)
    (query
      (node_type_identifier)
      (query
        (node_type_identifier)))))

========================================
child selectors
========================================

class_declaration {
  class_body {
    method_definition {

    }
  }
}

class_declaration > class_body {
  > method_definition {

  }
}

class_declaration {
  class_body > method_definition {

  }
}
class_declaration > class_body > method_definition {

}

---

(source_file
  (query
    (node_type_identifier)
    (query
      (node_type_identifier)
      (query
        (node_type_identifier))))
  (query
    (child_selector
      (node_type_identifier)
      (node_type_identifier))
    (query
      (child_selector
        (node_type_identifier))))
  (query
    (node_type_identifier)
    (query
      (child_selector
        (node_type_identifier)
        (node_type_identifier))))
  (query
    (child_selector
      (child_selector
        (node_type_identifier)
        (node_type_identifier))
      (node_type_identifier))))

========================================
descendant selectors
========================================

class_declaration class_body method_definition {

}


---

(source_file
  (query
    (descendant_selector
      (descendant_selector
        (node_type_identifier)
        (node_type_identifier))
      (node_type_identifier))))

========================================
named field selectors
========================================

class_declaration -> decorator -> function {

}


---

(source_file
  (query
    (descendant_selector
      (descendant_selector
        (node_type_identifier)
        (named_field_selector
          (node_type_identifier)))
      (named_field_selector
        (node_type_identifier)))))

========================================
attribute selectors
========================================


class_declaration[.name = 'foo'] {

}

class_declaration[.name = 'foo' && .baz = 'bar'] {

}

class_declaration[.name = 'foo' && .name = 'bar' || .name = 'baz'] {

}

class_declaration[.name = 'foo' || .name = 'bar' && .name = 'baz'] {

}

class_declaration[.name = 'foo' || (.name = 'bar' && .name = 'baz')] {

}

---

(source_file
  (query
    (node_condition
      (node_type_identifier)
      (attribute_condition
        (attribute_identifier
          (identifier))
        (relation)
        (string_literal
          (string_fragment)))))
  (query
    (node_condition
      (node_type_identifier)
      (and_condition
        (attribute_condition
          (attribute_identifier
            (identifier))
          (relation)
          (string_literal
            (string_fragment)))
        (attribute_condition
          (attribute_identifier
            (identifier))
          (relation)
          (string_literal
            (string_fragment))))))
  (query
    (node_condition
      (node_type_identifier)
      (or_condition
        (and_condition
          (attribute_condition
            (attribute_identifier
              (identifier))
            (relation)
            (string_literal
              (string_fragment)))
          (attribute_condition
            (attribute_identifier
              (identifier))
            (relation)
            (string_literal
              (string_fragment))))
        (attribute_condition
          (attribute_identifier
            (identifier))
          (relation)
          (string_literal
            (string_fragment))))))
  (query
    (node_condition
      (node_type_identifier)
      (and_condition
        (or_condition
          (attribute_condition
            (attribute_identifier
              (identifier))
            (relation)
            (string_literal
              (string_fragment)))
          (attribute_condition
            (attribute_identifier
              (identifier))
            (relation)
            (string_literal
              (string_fragment))))
        (attribute_condition
          (attribute_identifier
            (identifier))
          (relation)
          (string_literal
            (string_fragment))))))
  (query
    (node_condition
      (node_type_identifier)
      (or_condition
        (attribute_condition
          (attribute_identifier
            (identifier))
          (relation)
          (string_literal
            (string_fragment)))
        (and_condition
          (attribute_condition
            (attribute_identifier
              (identifier))
            (relation)
            (string_literal
              (string_fragment)))
          (attribute_condition
            (attribute_identifier
              (identifier))
            (relation)
            (string_literal
              (string_fragment))))))))
